const articles = [
  {
    title: "흔들리는 꽃들 속에서 네 샴푸향이 느껴진거야",
    singer: "장범준",
    author: "sample",
    score: `t100
    <d16'흔'd16'들'd8'리'd8'는'd8'꽃'c8'들'c8'속'd16'에'd4'서'
    d16''r2''f8'네'f8'샴'g8'푸'g8'향'g8'이'g8'느'f8'껴'd8'진'e16'거'd4'야'`,
  },
  {
    title: "흔들리는 꽃들 속에서 네 샴푸향이 느껴진거야",
    singer: "장범준",
    author: "sample",
    score: `t100
    <d16'흔'd16'들'd8'리'd8'는'd8'꽃'c8'들'c8'속'd16'에'd4'서'
d16''r2''f8'네'f8'샴'g8'푸'g8'향'g8'이'g8'느'f8'껴'd8'진'e16'거'd4'야'
d16''r2''d16'스'd16'쳐'e8'지'e8'나'e16'간'g8'건'f4'가'f16''r8''
e8'뒤'd8'돌'e8'아'd8'보'c16'지'c16''<b4'만'
r8''b16'그'b16'냥'r8''b16'사'b16'람'b8'들'g8'만'g8'보'b8'이'b8'는'>c16'거'c4'야'
/*M 12 */  c16''r2.''d16'다'd16'와'd8'가'd8'는'd8'집'c8'근'c8'처'd16'에'd4.'서'd16''r2''
f16'괜'f16'히'f8'핸'g8'드'g8'폰'g8'만'g8'만'f8'지'd8'는'e16'거'd4.'야'
/*M 16 */  d16''r2''d16'한'd16'번'e8'연'e8'락'e16'해'g8'볼'f4'까'f16''r8''
f8'용'f8'기'd8'내'f8'보'a16'지'a8'만'g8''.r8''
g16'그'a16'냥'b8'내'b8'마'b8'음'g8'만'g8'아'b8'쉬'b8'운'>c16'거'c4'야'
/*M 20 */  c16''r4''<f16'걷'f16'다'f16'가'g16'보'b8'면'
/*M 21 */  >d4'항'd8'상'.c16'이'c8'렇'd8'게'c8'너'<b8''g8'를'g8''r8''
>d16'바'd16'라'c8'만'd8'보'c8'던'<b8'너'g8'를'g8''r8''>d16'기'd16'다'd8'린'c8'다'<b8'고'
>c8'말'<b8'할'>d4'까'.r8''
<f16'지'f16'금'f16'집'g16'앞'b8'에'>d4'계'd8'속'.c16'이'c8''d8'렇'c8'게'<b8'너'g8'를'g8''r8''
>d16'아'd16'쉬'c8'워'd8'하'c8'다'<b8'너'g8'를'g8''r8''>d16'연'd16'락'd8'했'c8'다'<b8'할'b2'까'r2.''
d16'지'd16'나'd8'치'd8'는'd8'꽃'c8'들'c8'속'd16'에'd4'서'd16''r2''
f8'네'f8'샴'g8'푸'g8'향'g8'만'g8'보'f8'이'd8'는'e16'거'd4'야'd16''r2''
d16'스'd16'쳐'e8'지'e8'나'e16'간'g8'건'f4'가'f16''r8''
f8'뒤'f8'돌'd8'아'f8'보'a16'지'a8'만'g8''r8''
g16'그'a16'냥'b8'내'b8'마'b8'음'g8'만'g8'바'b8'빠'b8'진'>c16'거'c4'야'c16''r4''
<f16'걷'f16'다'f16'가'g16'보'b8'면'>d4'항'd8'상'c16'이'c8'렇'd8'게'c8'너'<b8''g8'를'g8''
r8''>d16'바'd16'라'c8'만'd8'보'c8'던'<b8'너'g8'를'g8''r8''>d16'기'd16'다'd8'린'c8'다'<b8'고'
>c8'말'<b8'할'>d4'까'r8''
<f16'지'f16'금'f16'집'g16'앞'b8'에'>d4'계'd8'속'c16'이'c8'렇'd8'게'c8'너'<b8''g8'를'g8''r8''
>d16'아'd16'쉬'c8'워'd8'하'c8'다'<b8'너'g8'를'g8''r8''>d16'연'd16'락'd8'했'c8'다'<b8'할'b4'까'r8''
a16'어'a16'떤'b8'계'>f8'절'f8'이'd8'너'c8''<b8'를'r8''>d16'우'd16'연'c8'히'd8'라'c8'도'
<b8'너'g8''g8'를'r8''>e16'마'e16'주'e8'치'd8'게'<b16'할'>c16'까'c4''r8''
c8'난'<a8'이'a8'대'>c8''c4'로'r8''
d16'아'd16'쉬'c8'워'd8'하'c8'다'<b8'너'g8''g8'를'r8''>d16'바'd16'라'c8'만'd8'보'c8'던'<b8'너'
g8''g8'를'r8''>e8'기'e8'다'd16'리'c16''c8'면'd8''e4'서'r8''
e16'아'e16'무'e8'말'd8'못'<b16'하'>c16'고'c4''r8''e16'그'e16'리'e8'워'd16'만'<b16'할'b16'까'>c16''c2''r4''
<f16'걷'f16'다'f16'가'g16'보'b8'면'
>d4'항'd8'상'.c16'이'c8'렇'd8'게'c8'너'<b8''g8'를'g8''r8''
>d16'바'd16'라'c8'만'd8'보'c8'던'<b8'너'g8'를'g8''r8''>d16'생'd16'각'd8'한'c8'다'<b8'고'
>c8'말'<b8'할'>d4'까'.r8''
<f16'지'f16'금'f16'집'g16'앞'b8'에'
>c16'기'd16'다'd16'리'd8'고'.d16'때'd16'론'c16'지'd16'나'd16'치'd8'고'
d16'다'd16'시'c16'기'd16'다'd16'리'd8'는'r16''d16'꽃'd16'이'g8'피'f8'는'd8'거'c16'리'c16'에'<b4''r8''
>e16'보'e16'고'e8'파'e8'라'e8'이'e16'밤'e16'에'd4''<b48''
b16'걷'b16'다'b16'가'>f16'보'f8'면'd4'항'd8'상'c16'이'c8'렇'd8'게'c8'너'<b8''g8'를'g8''r8''
>d16'아'd16'쉬'c8'워'd8'하'c8'다'<b8'너'g8'를'g8''r8''>d16'기'd16'다'd8'린'c8'다'<b8'고'
>c8'말'<b8'할'>d4'까'.r8''
<f16'지'f16'금'f16'집'g16'앞'b8'에'>d4'계'd8'속'c16'이'c8'렇'd8'게'c8'너'<b8''g8'를'g8''r8''
>d16'아'd16'쉬'c8'워'd8'하'c8'다'<b8'너'g8'를'g8''r8''>d16'연'd16'락'd8'했'c8'다'<b8'할'b2'까'`,
  },
];

class FileModel {
  constructor() {
    this.list = articles;
  }

  getLatest() {
    const result = this.list.slice(0, 20);
    return result;
  }

  search(keyword) {
    keyword = keyword.trim();
    return this.list
      .filter((article) => article.title.includes(keyword))
      .slice();
  }

  save(article) {
    if (article.idx) {
      this.edit(article);
    } else {
      this.add(article);
    }
  }

  add(article) {
    article.idx = this.list.length;
    this.list.push(article);
  }

  edit(article) {
    const item = this.list.find((i) => i.idx === article.idx);
    item.author = article.author;
    item.score = article.score;
    item.singer = article.singer;
    item.title = article.title;
  }
}

export { FileModel };
